Erulathra/Wbudy-STM32-Snake/src/main.c
/*
 * This file is part of the libopencm3 project.
 *
 * Copyright (C) 2009 Uwe Hermann <uwe@hermann-uwe.de>
 * Copyright (C) 2011 Stephen Caudle <scaudle@doceme.com>
 * Copyright (C) 2012 Karl Palsson <karlp@tweak.net.au>
 *
 * This library is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Lesser General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this library.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <libopencm3/stm32/rcc.h>
#include <libopencm3/stm32/gpio.h>

#ifdef STM32F0
#define RCCLEDPORT (RCC_GPIOE)
	#define LEDPORT (GPIOE)
	#define LEDPIN (GPIO8)
#elif STM32F1
#define RCCLEDPORT (RCC_GPIOC)
#define LEDPORT (GPIOC)
#define LEDPIN (GPIO13)
#define GPIO_MODE_OUTPUT GPIO_MODE_OUTPUT_2_MHZ
#define GPIO_PUPD_NONE GPIO_CNF_OUTPUT_PUSHPULL
#elif STM32F2
#define RCCLEDPORT (RCC_GPIOE)
	#define LEDPORT (GPIOE)
	#define LEDPIN (GPIO8)
#elif STM32F3
	#define RCCLEDPORT (RCC_GPIOE)
	#define LEDPORT (GPIOE)
	#define LEDPIN (GPIO8)
#elif STM32F4
	#define RCCLEDPORT (RCC_GPIOD)
	#define LEDPORT (GPIOD)
	#define LEDPIN (GPIO12)
#elif STM32F7
	#define RCCLEDPORT (RCC_GPIOD)
	#define LEDPORT (GPIOD)
	#define LEDPIN (GPIO12)
#elif STM32G0
	#define RCCLEDPORT (RCC_GPIOD)
	#define LEDPORT (GPIOD)
	#define LEDPIN (GPIO12)
#elif STM32G4
	#define RCCLEDPORT (RCC_GPIOD)
	#define LEDPORT (GPIOD)
	#define LEDPIN (GPIO12)
#elif STM32H7
	#define RCCLEDPORT (RCC_GPIOD)
	#define LEDPORT (GPIOD)
	#define LEDPIN (GPIO12)
#elif STM32L0
	#define RCCLEDPORT (RCC_GPIOB)
	#define LEDPORT (GPIOB)
	#define LEDPIN (GPIO6)
#elif STM32L1
	#define RCCLEDPORT (RCC_GPIOB)
	#define LEDPORT (GPIOB)
	#define LEDPIN (GPIO6)
#elif STM32L4
	#define RCCLEDPORT (RCC_GPIOB)
	#define LEDPORT (GPIOB)
	#define LEDPIN (GPIO6)
#else
    #error "This example doesn't support this target!"
#endif

static void gpio_setup(void)
{
	/* Enable GPIO clock. */
	/* Using API functions: */
	rcc_periph_clock_enable(RCCLEDPORT);
	/* Set pin to 'output push-pull'. */
	/* Using API functions: */
#ifdef STM32F1
	gpio_set_mode(LEDPORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, LEDPIN);
#else
	gpio_mode_setup(LEDPORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, LEDPIN);
#endif
}

int main(void)
{
	int i;
	gpio_setup();
	/* Blink the LED on the board. */
#pragma clang diagnostic push
#pragma ide diagnostic ignored "EndlessLoop"
	while (1) {
		/* Using API function gpio_toggle(): */
		//gpio_toggle(LEDPORT, LEDPIN);	/* LED on/off */
		GPIOC_ODR ^= GPIO13;
		for (i = 0; i < 500000; i++) {	/* Wait a bit. */
			__asm__("nop");
		}

	}
#pragma clang diagnostic pop

	return 0;
}